In [147]:
# -- This notebook provides a reference for techniques which are often used

In [206]:
# -- common imports needed
import sqlalchemy
import datetime as dt
import time
import numpy as np
import pandas as pd 
import json

In [207]:
# -- Make pandas show all columns, rows
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

In [208]:
# -- create a dataframe 
list_columns = ['weight', 'animal', 'age']
list_data = [
    [14, 'dog', 10],
    [4, 'cat', 15],
    [100, 'pig', 6],
    [400, 'horse', 3]
    ]
df_animals = pd.DataFrame(columns=list_columns, data=list_data)
df_animals.head()

   weight animal  age
0      14    dog   10
1       4    cat   15
2     100    pig    6
3     400  horse    3

In [209]:
# -- rename columns
df_animals = df_animals.rename(columns={'weight': 'wght_kg', 'age': 'age_yrs'})
df_animals.head()

   wght_kg animal  age_yrs
0       14    dog       10
1        4    cat       15
2      100    pig        6
3      400  horse        3

In [210]:
# -- just a fuction to get a new fresh dataframe
def get_new_animals():
    list_columns = ['weight', 'animal', 'age']
    list_data = [
        [14, 'dog', 10],
        [4, 'cat', 15],
        [100, 'pig', 6],
        [400, 'horse', 3]
        ]
    return pd.DataFrame(columns=list_columns, data=list_data)

In [211]:
# -- just a fuction to get a new dataframe for merging
def get_new_merge_df():
    list_columns = ['name', 'town']
    list_data = [
        ['dog', 'London'],
        ['cat', 'Milan'],
        ['dog', 'Paris'],
        ['duck', 'Milano']
        ]
    return pd.DataFrame(columns=list_columns, data=list_data)

In [212]:
# -- slice (select) certain values, eg age > 9
df_age = df_animals[df_animals.age_yrs > 9]
df_age.head()

   wght_kg animal  age_yrs
0       14    dog       10
1        4    cat       15

In [213]:
# -- slice (select) certain values more than one criteria, age > 3 and < 15
df_age = df_animals[(df_animals.age_yrs > 3)&(df_animals.age_yrs > 3)]
df_age.head()

   wght_kg animal  age_yrs
0       14    dog       10
1        4    cat       15
2      100    pig        6

In [214]:
# -- slice (select) certain values that are in a list
list_ages = [1,2,3,4,5,6,7,8,9]
df_age = df_animals[df_animals.age_yrs.isin(list_ages)]
df_age.head()

   wght_kg animal  age_yrs
2      100    pig        6
3      400  horse        3

In [215]:
# -- add a new column
df_animals['new_col'] = 0
df_animals.head()

   wght_kg animal  age_yrs  new_col
0       14    dog       10        0
1        4    cat       15        0
2      100    pig        6        0
3      400  horse        3        0

In [216]:
# -- drop / delete a column
df_animals = df_animals.drop(['new_col'], axis=1)
df_animals.head()

   wght_kg animal  age_yrs
0       14    dog       10
1        4    cat       15
2      100    pig        6
3      400  horse        3

In [217]:
df_animals = get_new_animals()
df_animals.head(2)

   weight animal  age
0      14    dog   10
1       4    cat   15

In [218]:
# -- drop / delete many columns
df_animals = df_animals.drop(['weight', 'animal'], axis=1)
df_animals.head()

   age
0   10
1   15
2    6
3    3

In [219]:
df_animals = get_new_animals()
df_animals.head(2)

   weight animal  age
0      14    dog   10
1       4    cat   15

In [220]:
df_animals.head()

   weight animal  age
0      14    dog   10
1       4    cat   15
2     100    pig    6
3     400  horse    3

In [221]:
# -- list comprehension ex. 1
df_animals['shortname'] =[ x[:-2] for x in df_animals['animal']]
df_animals.head()

   weight animal  age shortname
0      14    dog   10         d
1       4    cat   15         c
2     100    pig    6         p
3     400  horse    3       hor

In [222]:
# -- list comprehension ex. 2
df_animals['10_or_over'] = [True if x > 9 else False for x in df_animals['age']]
df_animals.head()

   weight animal  age shortname 10_or_over
0      14    dog   10         d       True
1       4    cat   15         c       True
2     100    pig    6         p      False
3     400  horse    3       hor      False

In [223]:
# -- list the types
df_animals.dtypes

weight         int64
animal        object
age            int64
shortname     object
10_or_over      bool
dtype: object

In [224]:
# -- change the 10_or_over type to an integer
df_animals['10_or_over'] = df_animals['10_or_over'].astype(int)

In [225]:
df_animals.head()

   weight animal  age shortname  10_or_over
0      14    dog   10         d           1
1       4    cat   15         c           1
2     100    pig    6         p           0
3     400  horse    3       hor           0

In [226]:
df_animals.dtypes

weight         int64
animal        object
age            int64
shortname     object
10_or_over     int64
dtype: object

In [227]:
# -- change the 10_or_over type to a string
df_animals['10_or_over'] = df_animals['10_or_over'].astype(str)

In [228]:
df_animals.dtypes

weight         int64
animal        object
age            int64
shortname     object
10_or_over    object
dtype: object

In [229]:
# -- pad number with leading zeros (up to 7)
df_animals['10_or_over'] = df_animals['10_or_over'].apply(lambda x: x.zfill(7))

In [230]:
df_animals.head()

   weight animal  age shortname 10_or_over
0      14    dog   10         d    0000001
1       4    cat   15         c    0000001
2     100    pig    6         p    0000000
3     400  horse    3       hor    0000000

In [231]:
# -- select specific columns
animals_spec = df_animals[['animal', 'weight']]
animals_spec.head()

  animal  weight
0    dog      14
1    cat       4
2    pig     100
3  horse     400

In [232]:
# -- apply a function to create a new column from existing values
def reverse_name(row):
    return row['animal'][::-1]

In [233]:
animals_spec['reversed'] = animals_spec.apply(reverse_name, axis=1)

/usr/local/lib/python2.7/site-packages/ipykernel/__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

In [234]:
animals_spec.head()

  animal  weight reversed
0    dog      14      god
1    cat       4      tac
2    pig     100      gip
3  horse     400    esroh

In [235]:
df_animals = get_new_animals()

In [236]:
# -- Merging - we need a new dataframe to merge with
df_to_merge = get_new_merge_df()
df_to_merge.head()

   name    town
0   dog  London
1   cat   Milan
2   dog   Paris
3  duck  Milano

In [179]:
# -- Merge with inner join
df_inner_merge = pd.merge(left=df_animals,
                         right=df_to_merge,
                         left_on='animal',
                         right_on='name',
                         how='inner')

In [180]:
df_inner_merge.head()

   weight animal  age name    town
0      14    dog   10  dog  London
1      14    dog   10  dog   Paris
2       4    cat   15  cat   Milan

In [181]:
# -- Merge with left join
df_left_merge = pd.merge(left=df_animals,
                         right=df_to_merge,
                         left_on='animal',
                         right_on='name',
                         how='left')

In [182]:
df_left_merge.head()

   weight animal  age name    town
0      14    dog   10  dog  London
1      14    dog   10  dog   Paris
2       4    cat   15  cat   Milan
3     100    pig    6  NaN     NaN
4     400  horse    3  NaN     NaN

In [183]:
# -- replace NaN with a string for a specific column
df_left_merge['name'].fillna('Empty', inplace=True)

In [184]:
df_left_merge.head()

   weight animal  age   name    town
0      14    dog   10    dog  London
1      14    dog   10    dog   Paris
2       4    cat   15    cat   Milan
3     100    pig    6  Empty     NaN
4     400  horse    3  Empty     NaN

In [185]:
# function to get merged df
def get_left_merged(df_l, df_r):
    return pd.merge(left=df_l,
                         right=df_r,
                         left_on='animal',
                         right_on='name',
                         how='left')

In [186]:
# -- replace NaN with a string for a all columns
df_left_merge.fillna('Empty', inplace=True)

In [187]:
df_left_merge.head()

   weight animal  age   name    town
0      14    dog   10    dog  London
1      14    dog   10    dog   Paris
2       4    cat   15    cat   Milan
3     100    pig    6  Empty   Empty
4     400  horse    3  Empty   Empty

In [188]:
df_left_merge = get_left_merged(df_animals, df_to_merge)

In [189]:
df_left_merge.head()

   weight animal  age name    town
0      14    dog   10  dog  London
1      14    dog   10  dog   Paris
2       4    cat   15  cat   Milan
3     100    pig    6  NaN     NaN
4     400  horse    3  NaN     NaN

In [190]:
# -- slice for non NaN for specific column
df_non_nan = df_left_merge[df_left_merge['name'].isnull()==False]
df_non_nan.head()

   weight animal  age name    town
0      14    dog   10  dog  London
1      14    dog   10  dog   Paris
2       4    cat   15  cat   Milan

In [191]:
# -- slice for non NaN for all columns
df_non_nan = df_left_merge[(df_left_merge['name'].isnull()==False)&(df_left_merge['town'].isnull()==False)]
df_non_nan.head()

   weight animal  age name    town
0      14    dog   10  dog  London
1      14    dog   10  dog   Paris
2       4    cat   15  cat   Milan

In [192]:
# -- dates

In [193]:
# -- make a small dataframe simulating piece produced timestamp
def get_piece_done_df():
    list_columns = ['spec', 'time_produced']
    list_data = [
        ['14', dt.datetime(2016, 9, 3, 11, 30, 50)],
        ['14', dt.datetime(2016, 9, 3, 11, 32, 59)],
        ['14', dt.datetime(2016, 9, 3, 11, 38, 43)],
        ['14', dt.datetime(2016, 9, 3, 11, 41, 34)],
        ['14', dt.datetime(2016, 9, 3, 11, 43, 50)],
        ['14', dt.datetime(2016, 9, 3, 11, 49, 6)]
        ]
    return pd.DataFrame(columns=list_columns, data=list_data)

In [194]:
df_piece_done = get_piece_done_df()
df_piece_done.head(10)

  spec       time_produced
0   14 2016-09-03 11:30:50
1   14 2016-09-03 11:32:59
2   14 2016-09-03 11:38:43
3   14 2016-09-03 11:41:34
4   14 2016-09-03 11:43:50
5   14 2016-09-03 11:49:06

In [195]:
# -- shift the times up to get the time of the successive piece
df_piece_done['time_next_produced']=df_piece_done['time_produced'].shift(-1)
df_piece_done.head()

  spec       time_produced  time_next_produced
0   14 2016-09-03 11:30:50 2016-09-03 11:32:59
1   14 2016-09-03 11:32:59 2016-09-03 11:38:43
2   14 2016-09-03 11:38:43 2016-09-03 11:41:34
3   14 2016-09-03 11:41:34 2016-09-03 11:43:50
4   14 2016-09-03 11:43:50 2016-09-03 11:49:06

In [196]:
# -- make time delta
df_piece_done['time_delta']=df_piece_done['time_next_produced']-df_piece_done['time_produced']
df_piece_done.head(10)

  spec       time_produced  time_next_produced  time_delta
0   14 2016-09-03 11:30:50 2016-09-03 11:32:59    00:02:09
1   14 2016-09-03 11:32:59 2016-09-03 11:38:43    00:05:44
2   14 2016-09-03 11:38:43 2016-09-03 11:41:34    00:02:51
3   14 2016-09-03 11:41:34 2016-09-03 11:43:50    00:02:16
4   14 2016-09-03 11:43:50 2016-09-03 11:49:06    00:05:16
5   14 2016-09-03 11:49:06                 NaT         NaT

In [197]:
# -- remove the NaT
df_piece_done = df_piece_done[df_piece_done['time_delta'].isnull()==False]

In [198]:
df_piece_done.head(10)

  spec       time_produced  time_next_produced  time_delta
0   14 2016-09-03 11:30:50 2016-09-03 11:32:59    00:02:09
1   14 2016-09-03 11:32:59 2016-09-03 11:38:43    00:05:44
2   14 2016-09-03 11:38:43 2016-09-03 11:41:34    00:02:51
3   14 2016-09-03 11:41:34 2016-09-03 11:43:50    00:02:16
4   14 2016-09-03 11:43:50 2016-09-03 11:49:06    00:05:16

In [199]:
# -- convert delta into seconds
gimme_seconds = lambda x: x / np.timedelta64(1, 's')
df_piece_done['time_delta_seconds'] = df_piece_done['time_delta'] .apply(gimme_seconds)
df_piece_done.head(10)

  spec       time_produced  time_next_produced  time_delta  time_delta_seconds
0   14 2016-09-03 11:30:50 2016-09-03 11:32:59    00:02:09                 129
1   14 2016-09-03 11:32:59 2016-09-03 11:38:43    00:05:44                 344
2   14 2016-09-03 11:38:43 2016-09-03 11:41:34    00:02:51                 171
3   14 2016-09-03 11:41:34 2016-09-03 11:43:50    00:02:16                 136
4   14 2016-09-03 11:43:50 2016-09-03 11:49:06    00:05:16                 316

In [200]:
# -- convert dates to strings
df_piece_done.dtypes

spec                           object
time_produced          datetime64[ns]
time_next_produced     datetime64[ns]
time_delta            timedelta64[ns]
time_delta_seconds            float64
dtype: object

In [201]:
df_piece_done['time_produced_string']= [x.strftime("%Y-%m-%d %H:%M:%S") for x in df_piece_done['time_produced']]
df_piece_done.head(10)

,spec,time_produced,time_next_produced,time_delta,time_delta_seconds,time_produced_string
0,14,2016-09-03 11:30:50,2016-09-03 11:32:59,00:02:09,129,2016-09-03 11:30:50
1,14,2016-09-03 11:32:59,2016-09-03 11:38:43,00:05:44,344,2016-09-03 11:32:59
2,14,2016-09-03 11:38:43,2016-09-03 11:41:34,00:02:51,171,2016-09-03 11:38:43
3,14,2016-09-03 11:41:34,2016-09-03 11:43:50,00:02:16,136,2016-09-03 11:41:34
4,14,2016-09-03 11:43:50,2016-09-03 11:49:06,00:05:16,316,2016-09-03 11:43:50

In [202]:
df_piece_done.dtypes

spec                             object
time_produced            datetime64[ns]
time_next_produced       datetime64[ns]
time_delta              timedelta64[ns]
time_delta_seconds              float64
time_produced_string             object
dtype: object

In [203]:
# add on week number, month, week day, month number columns
df_piece_done['wk_num'] = [x.isocalendar()[1] for x in df_piece_done['time_produced']]
df_piece_done['year'] = [x.isocalendar()[0] for x in df_piece_done['time_produced']]
df_piece_done['wk_day'] = [x.isocalendar()[2] for x in df_piece_done['time_produced']]
df_piece_done['month'] = [x.month for x in df_piece_done['time_produced']]

In [204]:
df_piece_done.head(10)

,spec,time_produced,time_next_produced,time_delta,time_delta_seconds,time_produced_string,wk_num,year,wk_day,month
0,14,2016-09-03 11:30:50,2016-09-03 11:32:59,00:02:09,129,2016-09-03 11:30:50,35,2016,6,9
1,14,2016-09-03 11:32:59,2016-09-03 11:38:43,00:05:44,344,2016-09-03 11:32:59,35,2016,6,9
2,14,2016-09-03 11:38:43,2016-09-03 11:41:34,00:02:51,171,2016-09-03 11:38:43,35,2016,6,9
3,14,2016-09-03 11:41:34,2016-09-03 11:43:50,00:02:16,136,2016-09-03 11:41:34,35,2016,6,9
4,14,2016-09-03 11:43:50,2016-09-03 11:49:06,00:05:16,316,2016-09-03 11:43:50,35,2016,6,9